packages/core/src/external/carequality/ihe-gateway-v2/outbound/__tests__/xmls/xcpd_match_multi_addr_name.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap:Header>
        <wsa:To soap:mustUnderstand="true">http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
        <wsa:Action soap:mustUnderstand="true">urn:hl7-org:v3:PRPA_IN201306UV02:CrossGatewayPatientDiscovery</wsa:Action>
        <wsa:MessageID soap:mustUnderstand="true">urn:uuid:d3253e2a-6f85-4aff-8cbc-aedf2fb14db5</wsa:MessageID>
        <wsa:RelatesTo soap:mustUnderstand="true">urn:uuid:1234</wsa:RelatesTo>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-83a4fbe2-ea81-48f2-a7f3-8f8a9b100b67">
                <wsu:Created>2024-04-07T15:05:44.236Z</wsu:Created>
                <wsu:Expires>2024-04-07T15:09:04.236Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse11:SignatureConfirmation xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" Value="gpKiK45RcOzh1ptjZsQrRDfQQJnb1MGuXr8ZP5pBRqfRmDI3W/UlN10Y8Cs+rd/f8oFI+5yiFCDJDfjQZZIQzWjLzhkAyeS3Us0aWjlA6o6Y66gUp1q9/51WmB8AnwFx3gs9umgDs9xMBy7gj8pMPcsPrvd8UmUun6TlII2E3ooZEy13Dnc+dmAUUPSbyrG4mmgi5e4Jz8wDwm1Mu6O4x/6rP5OiBVb0FS0/vnX0COeoCWjBkq1UZrUnmcnW1HugbOFbt42GcKwpkQ3KO5yMIKtx5YlIozCk2nV0gSopWHEl3asmn+nUrnzxDzj/W92RywjL/lsVSxO2Q0XZ1/GPQA==" wsu:Id="SC-e9b1bd27-c8e2-43c1-97f1-b35204863554"/>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0">
            <id extension="370e04f9-22d8-4679-82a3-fa90dc5c1a60" root="2.16.840.1.113883.3.9621"/>
            <creationTime value="20240407030724"/>
            <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="NE"/>
            <receiver typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.9621"/>
                    <asAgent classCode="AGNT">
                        <representedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <id root="2.16.840.1.113883.3.9621"/>
                            <name>Metriport</name>
                        </representedOrganization>
                    </asAgent>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.9621"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                    <id extension="1234" root="2.16.840.1.113883.3.9621"/>
                </targetMessage>
            </acknowledgement>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201306UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <authorOrPerformer typeCode="AUT">
                    <assignedDevice classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.3.9621"/>
                    </assignedDevice>
                </authorOrPerformer>
                <subject contextConductionInd="false" typeCode="SUBJ">
                    <registrationEvent classCode="REG" moodCode="EVN">
                        <statusCode code="active"/>
                        <subject1 typeCode="SBJ">
                            <patient classCode="PAT">
                                <id extension="ODFmMmVjNGUtYzcxYy00MDkwLWJmMWMtOWQ4NTI5ZjY1YjVhLzAxOGUxMDU4LTllMWEtN2MzMy1hMmRkLTVhNzg4NGU2ZmMzOA==" root="2.16.840.1.113883.3.9621"/>
                                <statusCode code="active"/>
                                <patientPerson>
                                    <name>
                                        <given>NWHINONE</given>
                                        <family>NWHINZZZTESTPATIENT</family>
                                    </name>
                                    <name>
                                        <given>nwhinone</given>
                                        <given>bartholomew</given>
                                        <family>nwhinzzztestpatient</family>
                                    </name>
                                    <administrativeGenderCode code="M"/>
                                    <birthTime value="19810101"/>
                                    <addr>
                                        <streetAddressLine>1100 Test Street</streetAddressLine>
                                        <city>Helena</city>
                                        <state>AL</state>
                                        <postalCode>35080</postalCode>
                                        <country>USA</country>
                                    </addr>
                                    <addr>
                                        <streetAddressLine>1200 Test Street</streetAddressLine>
                                        <streetAddressLine>APT 1A</streetAddressLine>
                                        <city>Helena</city>
                                        <state>AL</state>
                                        <postalCode>35080</postalCode>
                                        <country>USA</country>
                                    </addr>
                                    <telecom use="MC" value="tel:+1310-000-0000" />
                                    <telecom use="H" value="mailto:test@test.com" />
                                </patientPerson>
                                <subjectOf1>
                                    <queryMatchObservation classCode="OBS" moodCode="EVN">
                                        <code code="IHE_PDQ"/>
                                        <value value="99" xsi:type="INT"/>
                                    </queryMatchObservation>
                                </subjectOf1>
                            </patient>
                        </subject1>
                        <custodian typeCode="CST">
                            <assignedEntity classCode="ASSIGNED">
                                <id root="2.16.840.1.113883.3.9621"/>
                                <code code="NotHealthDataLocator" codeSystem="1.3.6.1.4.1.19376.1.2.27.2"/>
                            </assignedEntity>
                        </custodian>
                    </registrationEvent>
                </subject>
                <queryAck>
                    <queryId extension="1234" root="2.16.840.1.113883.3.9621"/>
                    <queryResponseCode code="OK"/>
                </queryAck>
                <queryByParameter>
                    <queryId extension="1234" root="2.16.840.1.113883.3.9621"/>
                    <statusCode code="new"/>
                    <parameterList>
                        <livingSubjectAdministrativeGender>
                            <value code="M" codeSystem="2.16.840.1.113883.5.1"/>
                            <semanticsText>LivingSubject.administrativeGender</semanticsText>
                        </livingSubjectAdministrativeGender>
                        <livingSubjectBirthTime>
                            <value value="19810101"/>
                            <semanticsText>LivingSubject.birthTime</semanticsText>
                        </livingSubjectBirthTime>
                        <livingSubjectId>
                            <value extension="666-10-0001" root="2.16.840.1.113883.4.1"/>
                            <semanticsText>LivingSubject.id</semanticsText>
                        </livingSubjectId>
                        <livingSubjectName>
                            <value>
                                <family>NWHINZZZTESTPATIENT</family>
                                <given>NWHINONE</given>
                            </value>
                            <semanticsText>LivingSubject.name</semanticsText>
                        </livingSubjectName>
                        <patientAddress>
                            <value>
                                <streetAddressLine>1100 Test Street</streetAddressLine>
                                <city>Helena</city>
                                <state>AL</state>
                                <postalCode>35080</postalCode>
                                <country>USA</country>
                            </value>
                            <semanticsText>Patient.addr</semanticsText>
                        </patientAddress>
                        <patientTelecom>
                            <value value="tel:205-111-1111"/>
                            <semanticsText>Patient.telecom</semanticsText>
                        </patientTelecom>
                        <principalCareProviderId>
                            <value extension="1234" root="2.16.840.1.113883.4.6"/>
                        </principalCareProviderId>
                    </parameterList>
                </queryByParameter>
            </controlActProcess>
        </PRPA_IN201306UV02>
    </soap:Body>
</soap:Envelope>
