src/templates/PRPA_IN201305UV02.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
    <env:Header/>
    <env:Body>
        <PRPA_IN201305UV02 xsi:schemaLocation="urn:hl7-org:v3 ./schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201305UV02.xsd" ITSVersion="XML_1.0"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">
            <id root="2.16.840.1.113883.4.714" extension="123456"/>
            <creationTime>
                {{ now }}
            </creationTime>
            <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201305UV02"/>
            <processingCode code="T"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.72.6.5.100.85"/>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.72.6.2"/>
                    <name>[SYSTEMCODE]</name>
                </device>
            </sender>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <queryByParameter>
                    <queryId root="1.2.840.114350.1.13.28.1.18.5.999" extension="1840997084"/>
                    <statusCode code="new"/>
                    <responseModalityCode code="R"/>
                    <responsePriorityCode code="I"/>
                    <parameterList>
                        {% if sexo %}
                        <livingSubjectAdministrativeGender>
                            <value code="{{sexo}}" codeSystem="2.16.840.1.113883.5.1"/>
                            <semanticsText>LivingSubject.administrativeGender</semanticsText>
                        </livingSubjectAdministrativeGender>
                        {% endif %}
                        {% if data_nascimento %}
                        <livingSubjectBirthTime>
                            <value value="{{ data_nascimento }}" />
                            <semanticsText>LivingSubject.birthTime</semanticsText>
                        </livingSubjectBirthTime>
                        {% endif %}
                        {% if cpf %}
                        <livingSubjectId>
                            <value root="2.16.840.1.113883.13.237" extension="{{cpf}}"/>
                            <semanticsText>LivingSubject.id</semanticsText>
                        </livingSubjectId>
                        {% endif %}
                        {% if cns %}
                        <livingSubjectId>
                            <value root="2.16.840.1.113883.13.236" extension="{{cns}}"/>
                            <semanticsText>LivingSubject.id</semanticsText>
                        </livingSubjectId>
                        {% endif %}
                        {% if nome %}
                        <livingSubjectName>
                            <value use="L">
                                <given>{{nome}}</given>
                            </value>
                            <semanticsText>LivingSubject.Given</semanticsText>
                        </livingSubjectName>
                        {% endif %}
                        {% if nome_mae %}
                        <mothersMaidenName>
                            <value use="L">
                                <family>{{nome_mae}}</family>
                            </value>
                            <semanticsText>mothersMaidenName</semanticsText>
                        </mothersMaidenName>
                        {% endif %}
                        {% if tenant %}
                        <patientAddress>
                            <value use="BIRTHPL">
                                <city>{{tenant}}</city>
                            </value>
                            <semanticsText>LivingSubject.birthPlaceAddress</semanticsText>
                        </patientAddress>
                        {% endif %}
                    </parameterList>
                </queryByParameter>
            </controlActProcess>
        </PRPA_IN201305UV02>
    </env:Body>
</env:Envelope>